stressTesting/dev_test.yaml
config:
  target: "http://localhost:8880"
  phases:
    - duration: 30
      arrivalRate: 5
      rampTo: 25
    - duration: 30
      arrivalRate: 25
      rampTo: 50
    - duration: 300
      arrivalRate: 50
scenarios:
  - name: "get random track from collection & random track from last 10% of collection"
    flow:
        - get:
            url: "/{{ $randomNumber(1, 10000000) }}"
        - get:
            url: "/{{ $randomNumber(9000000, 10000000) }}"